package lesson01;

/*
Любимое стихотворение
В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".


Requirements:
1. Программа должна выводить текст.
2. Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
3. Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
4. В выводимом тексте должно быть не менее, чем 50 символов.
 */

public class task0121 {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("Нет правды и добра, лишь равновесье,");
        System.out.println("Подвесило незримые весы,");
        System.out.println("Совсем случайно, зацепив за месяц,");
        System.out.println("Что освещает старые часы.");

    }
}
