package lesson03;

/*
Я так давно родился
Вывести на экран дату своего рождения в виде:
MAY 1 2012

Requirements:
1. Выводимый текст должен содержать месяц, день и год, разделенные пробелом.
2. Название месяца должно выводиться на английском языке и заглавными буквами.
3. Год должен состоять из четырех цифр и быть не меньше 1900.
4. Дата рождения должна предшествовать текущей.
 */

public class task0305 {
    public static void main(String[] args) {
        System.out.println("MAY" + " " + 19 + " " + 1988);
    }
}
