package lesson00;

/*
Мой юный друг
Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.

Requirements:
1. В программе должен использоваться вывод на экран.
2. Выведенный год должен состоять из 4 цифр.
3. Выведенный год должен начинаться с "31".
4. Выведенный год должен соответствовать заданию.
 */

public class task0004 {
    public static void main(String[] args) {
        System.out.println(3126 - 8 + " " + "год рождения Эллиного друга");
    }
}
