package lesson00;

/*
Баги и фичи
Напиши программу, которая выводит на экран надпись:

Это не баг, это фича.

Requirements:
1. Программа должна выводить текст.
2. Текст должен начинаться с "Это не баг".
3. Текст должен заканчиваться точкой.
4. Текст должен состоять из 21 символа, включая пробелы и знаки препинания.
5. Выводимый текст должен соответствовать заданию.
 */

public class task0006 {
    public static void main(String[] args) {
        System.out.println("Это не баг, это фича.");
    }
}
