package lesson02;

/*
Кусочек калькулятора
В методе main объяви две переменные a и b типа int.
Присвой им любые значения.
Выведи на экран их сумму и произведение.
Каждое значение выводить с новой строки.

Пример вывода на экран для а = 5, b = 7:
12
35

Requirements:
1. Программа должна выводить текст на экран.
2. В программе должны быть только две переменные: a и b типа int.
3. Переменным сразу должны быть присвоены значения.
4. Метод main должен выводить на экран сумму переменных a и b.
5. Метод main должен выводить на экран произведение переменных a и b.
6. Каждое значение должно быть выведено с новой строки
 */

public class task0205 {
    public static void main(String[] args) {
        int a = 66;
        int b = 77;

        System.out.println(a + b);
        System.out.println(a - b);
    }
}
